marttrach/ThreadX_STM32H750XBHx/Src/i2c_hub_uart.c
#include "i2c_hub_uart.h"
#include <string.h>
#include "main.h"
#include "iot.h"
#include "stm32h7xx_hal_uart.h"

static uint8_t  uart7_dma_rx_buf[UART_RX_BUF_SZ] __attribute__((aligned(32)));
static uint8_t  uart8_dma_rx_buf[UART_RX_BUF_SZ] __attribute__((aligned(32)));

static iot_uart_rx_ring_t uart7_rx_ring = {0};
static iot_uart_tx_ring_t uart7_tx_ring = {0};
static volatile uint16_t uart7_last_pos = 0;
static iot_uart_rx_ring_t uart8_rx_ring = {0};
static iot_uart_tx_ring_t uart8_tx_ring = {0};
static volatile uint16_t uart8_last_pos = 0;

#define UART7_TX (&uart7_tx_ring)
#define UART7_RX (&uart7_rx_ring)
#define UART8_TX (&uart8_tx_ring)
#define UART8_RX (&uart8_rx_ring)

static TX_QUEUE  s_uart7_q;
static TX_THREAD s_uart7_thread;
static UCHAR     s_uart7_q_buf[32 * sizeof(ULONG)];
static UCHAR     s_uart7_stack[4096];
static volatile UINT s_uart7_started = 0;
static TX_SEMAPHORE s_uart7_tx_gate;
static TX_SEMAPHORE s_uart7_tx_done;

static TX_QUEUE  s_uart8_q;
static TX_THREAD s_uart8_thread;
static UCHAR     s_uart8_q_buf[32 * sizeof(ULONG)];
static UCHAR     s_uart8_stack[4096];
static volatile UINT s_uart8_started = 0;
static TX_SEMAPHORE s_uart8_tx_gate;
static TX_SEMAPHORE s_uart8_tx_done;

#ifndef UART_RECOVER_ESCALATION_MS
#define UART_RECOVER_ESCALATION_MS   50U
#endif
#ifndef UART_RECOVER_THRESHOLD
#define UART_RECOVER_THRESHOLD       3U
#endif
#ifndef TX_DMA_TC_FLAG
#define TX_DMA_TC_FLAG   DMA_FLAG_TCIF0_4
#define TX_DMA_ERR_FLAGS (DMA_FLAG_TEIF0_4 | DMA_FLAG_DMEIF0_4 | DMA_FLAG_FEIF0_4)
#endif
#define UART_RESP_SLOTS  4 

static volatile uint32_t s_u7_err_tick = 0, s_u8_err_tick = 0;
static volatile uint8_t  s_u7_err_cnt  = 0, s_u8_err_cnt  = 0;
static volatile UINT s_uart_tx_sem_inited = 0U;

typedef struct {
    uint8_t     *frame;
    hub_tx_task_t task;
    volatile uint8_t busy;
} uart_resp_slot_t;

typedef struct {
    uart_resp_slot_t slot[UART_RESP_SLOTS];
    uint32_t         cap;
    uint8_t          wr;
} uart_resp_ctx_t;

typedef struct {
    UART_HandleTypeDef *huart;
    TX_SEMAPHORE       *gate;
    TX_SEMAPHORE       *done;
} uart_tx_sem_map_t;

static uart_resp_ctx_t s_u7_ctx = {0};
static uart_resp_ctx_t s_u8_ctx = {0};

static VOID uart7_thread_entry(ULONG arg);
static VOID uart8_thread_entry(ULONG arg);

static inline void _uart_port_map(UART_HandleTypeDef *huart, uint8_t **rx_dma_buf, volatile uint16_t **plast_pos, iot_uart_tx_ring_t **ptx_ring)
{
    if (huart == &huart7) {
        *rx_dma_buf = uart7_dma_rx_buf;
        *plast_pos  = &uart7_last_pos;
        *ptx_ring   = UART7_TX;
    } else {
        *rx_dma_buf = uart8_dma_rx_buf;
        *plast_pos  = &uart8_last_pos;
        *ptx_ring   = UART8_TX;
    }
}

static inline uart_tx_sem_map_t uart_tx_map(UART_HandleTypeDef *huart)
{
    uart_tx_sem_map_t m = {0};
    if (huart == &huart7) {
        m.huart = &huart7; m.gate = &s_uart7_tx_gate; m.done = &s_uart7_tx_done;
    } else if (huart == &huart8) {
        m.huart = &huart8; m.gate = &s_uart8_tx_gate; m.done = &s_uart8_tx_done;
    }
    return m;
}

static void uart_tx_sem_init_once(void)
{
    if (s_uart_tx_sem_inited) return;

    tx_semaphore_create(&s_uart7_tx_gate, "uart7_tx_gate", 1);
    tx_semaphore_create(&s_uart7_tx_done, "uart7_tx_done", 0);

    tx_semaphore_create(&s_uart8_tx_gate, "uart8_tx_gate", 1);
    tx_semaphore_create(&s_uart8_tx_done, "uart8_tx_done", 0);

    s_uart_tx_sem_inited = 1U;
}

static void uart_tx_done_cb(hub_tx_task_t *t)
{
    if (!t || !t->user_ctx) return;
    uart_resp_slot_t *slot = (uart_resp_slot_t *)t->user_ctx;
    slot->busy = 0;
}

static uart_resp_slot_t *uart_resp_take_free(uart_resp_ctx_t *ctx)
{
    for (int i = 0; i < UART_RESP_SLOTS; ++i) {
        uint8_t idx = (ctx->wr + i) & (UART_RESP_SLOTS - 1);
        if (!ctx->slot[idx].busy) {
            ctx->wr = (idx + 1) & (UART_RESP_SLOTS - 1);
            ctx->slot[idx].busy = 1;
            return &ctx->slot[idx];
        }
    }
    return NULL;
}

static inline uint16_t dma_get_pos(const DMA_HandleTypeDef *hdma)
{
    return (uint16_t)(UART_RX_BUF_SZ - __HAL_DMA_GET_COUNTER(hdma));
}

static inline uint16_t dma_get_pos_stable(const DMA_HandleTypeDef *hdma)
{
    uint16_t p1, p2;
    do {
        p1 = dma_get_pos(hdma);
        __DSB();
        p2 = dma_get_pos(hdma);
    } while (p1 != p2);
    return p1;
}

void iot_uart_init(void)
{
    memset(&uart7_rx_ring, 0, sizeof(uart7_rx_ring));
    memset(&uart8_rx_ring, 0, sizeof(uart8_rx_ring));
    memset(&uart7_tx_ring, 0, sizeof(uart7_tx_ring));
    memset(&uart8_tx_ring, 0, sizeof(uart8_tx_ring));
    uart7_rx_dma_start();
    uart8_rx_dma_start();
    uart_tx_sem_init_once();
}

static int uart_resp_ctx_init(uart_resp_ctx_t *ctx)
{
    ctx->cap = (uint32_t)(RSP_HDR_SZ + UART_RX_BUF_SZ + 4U);
    for (int i = 0; i < UART_RESP_SLOTS; ++i) {
        ctx->slot[i].frame = (uint8_t*)hub_heap_alloc_aligned(ALIGN32(ctx->cap), HUB_DMA_ALIGN);
        if (!ctx->slot[i].frame) return 0;
        ctx->slot[i].busy  = 0;
        ctx->slot[i].task.buf         = ctx->slot[i].frame;
        ctx->slot[i].task.total       = 0;
        ctx->slot[i].task.sent        = 0;
        ctx->slot[i].task.stage_tx    = TX_STAGE_HDR;
        ctx->slot[i].task.alloc_flags = HUB_TASK_F_STATIC_BUF | HUB_TASK_F_STATIC_TASK;
        ctx->slot[i].task.done_cb     = uart_tx_done_cb;
        ctx->slot[i].task.user_ctx    = &ctx->slot[i];
    }
    ctx->wr = 0;
    return 1;
}

static void uart_rx_drain_dma(UART_HandleTypeDef *huart,
                              iot_uart_rx_ring_t *rx,
                              uint8_t *dma_buf,
                              volatile uint16_t *plast_pos)
{
    uint16_t cur_pos = dma_get_pos_stable(huart->hdmarx);
    if (cur_pos == *plast_pos) return;

    uint16_t delta = (cur_pos > *plast_pos)
                   ? (cur_pos - *plast_pos)
                   : (UART_RX_BUF_SZ - *plast_pos + cur_pos);

    uint32_t free = (rx->read_ptr > rx->write_ptr)
                  ? (rx->read_ptr - rx->write_ptr - 1U)
                  : (UART_RX_BUF_SZ - rx->write_ptr + rx->read_ptr - 1U);

    if (free == 0) {
        *plast_pos = cur_pos;
        return;
    }

    uint32_t to_copy = (delta > free) ? free : delta;

    uint32_t first_dma = UART_RX_BUF_SZ - *plast_pos;
    if (first_dma > to_copy) first_dma = to_copy;

    dcache_invalidate32_range(dma_buf + *plast_pos, first_dma);

    uint32_t wp = rx->write_ptr;
    uint32_t first_ring = UART_RX_BUF_SZ - wp;
    uint32_t first_copy = (first_ring > first_dma) ? first_dma : first_ring;
    memcpy(rx->buf + wp, dma_buf + *plast_pos, first_copy);
    wp = (wp + first_copy) & (UART_RX_BUF_SZ - 1U);

    uint32_t remain_first = first_dma - first_copy;
    if (remain_first) {
        memcpy(rx->buf + wp, dma_buf + *plast_pos + first_copy, remain_first);
        wp = (wp + remain_first) & (UART_RX_BUF_SZ - 1U);
    }

    uint32_t second_dma = to_copy - first_dma;
    if (second_dma) {
        dcache_invalidate32_range(dma_buf, second_dma);

        uint32_t ring_left = UART_RX_BUF_SZ - wp;
        uint32_t second_copy1 = (ring_left > second_dma) ? second_dma : ring_left;
        memcpy(rx->buf + wp, dma_buf, second_copy1);
        wp = (wp + second_copy1) & (UART_RX_BUF_SZ - 1U);

