marttrach/ThreadX_STM32H750XBHx/Src/i2c_hub_uart.c
        uint32_t second_copy2 = second_dma - second_copy1;
        if (second_copy2) {
            memcpy(rx->buf + wp, dma_buf + second_copy1, second_copy2);
            wp = (wp + second_copy2) & (UART_RX_BUF_SZ - 1U);
        }
    }

    rx->write_ptr  = wp;
    *plast_pos     = cur_pos;
    __DMB();
}

void HAL_UART_RxHalfCpltCallback(UART_HandleTypeDef *huart)
{
    if (huart == &huart7) {
        uart_rx_drain_dma(huart, UART7_RX, uart7_dma_rx_buf, &uart7_last_pos);
    } else if (huart == &huart8) {
        uart_rx_drain_dma(huart, UART8_RX, uart8_dma_rx_buf, &uart8_last_pos);
    }
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    if (huart == &huart7) {
        uart_rx_drain_dma(huart, UART7_RX, uart7_dma_rx_buf, &uart7_last_pos);
    } else if (huart == &huart8) {
        uart_rx_drain_dma(huart, UART8_RX, uart8_dma_rx_buf, &uart8_last_pos);
    }
}

static inline void uart7_rx_sync_from_dma(void){
    uart_rx_drain_dma(&huart7, UART7_RX, uart7_dma_rx_buf, &uart7_last_pos);
}
static inline void uart8_rx_sync_from_dma(void){
    uart_rx_drain_dma(&huart8, UART8_RX, uart8_dma_rx_buf, &uart8_last_pos);
}

/* RX */
void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t Size){
    if (huart == &huart7){
        uint16_t cur_pos = dma_get_pos_stable(huart->hdmarx);
        if (cur_pos == uart7_last_pos) return;

        uint16_t delta = (cur_pos > uart7_last_pos)
                    ? (cur_pos - uart7_last_pos)
                    : (UART_RX_BUF_SZ - uart7_last_pos + cur_pos);

        iot_uart_rx_ring_t *rx = UART7_RX;
        uint32_t free = (rx->read_ptr > rx->write_ptr) ?
                        (rx->read_ptr - rx->write_ptr - 1U) :
                        (UART_RX_BUF_SZ - rx->write_ptr + rx->read_ptr - 1U);

        if (free == 0) {
            uart7_last_pos = cur_pos;
            return;
        }
        uint32_t to_copy = (delta > free) ? free : delta;
        uint32_t first_dma = UART_RX_BUF_SZ - uart7_last_pos;
        if (first_dma > to_copy) first_dma = to_copy;
        dcache_invalidate32_range(uart7_dma_rx_buf + uart7_last_pos, first_dma);
        uint32_t second_dma = to_copy - first_dma;
        if (second_dma) dcache_invalidate32_range(uart7_dma_rx_buf, second_dma);
        uint32_t wp = rx->write_ptr;
        uint32_t first_ring = UART_RX_BUF_SZ - wp;
        uint32_t first_copy = (first_ring > first_dma) ? first_dma : first_ring;
        memcpy(rx->buf + wp, uart7_dma_rx_buf + uart7_last_pos, first_copy);
        wp = (wp + first_copy) & (UART_RX_BUF_SZ - 1U);

        uint32_t remain_first = first_dma - first_copy;
        if (remain_first) {
            memcpy(rx->buf + wp, uart7_dma_rx_buf + uart7_last_pos + first_copy, remain_first);
            wp = (wp + remain_first) & (UART_RX_BUF_SZ - 1U);
        }
        if (second_dma) {
            uint32_t ring_left = UART_RX_BUF_SZ - wp;
            uint32_t second_copy1 = (ring_left > second_dma) ? second_dma : ring_left;
            memcpy(rx->buf + wp, uart7_dma_rx_buf, second_copy1);
            wp = (wp + second_copy1) & (UART_RX_BUF_SZ - 1U);

            uint32_t second_copy2 = second_dma - second_copy1;
            if (second_copy2) {
                memcpy(rx->buf + wp, uart7_dma_rx_buf + second_copy1, second_copy2);
                wp = (wp + second_copy2) & (UART_RX_BUF_SZ - 1U);
            }
        }
        rx->write_ptr  = wp;
        uart7_last_pos = cur_pos;
    }else if(huart == &huart8){
        uint16_t cur_pos = dma_get_pos_stable(huart->hdmarx);
        if (cur_pos == uart8_last_pos) return;

        uint16_t delta = (cur_pos > uart8_last_pos)
                    ? (cur_pos - uart8_last_pos)
                    : (UART_RX_BUF_SZ - uart8_last_pos + cur_pos);

        iot_uart_rx_ring_t *rx = UART8_RX;
        uint32_t free = (rx->read_ptr > rx->write_ptr) ?
                        (rx->read_ptr - rx->write_ptr - 1U) :
                        (UART_RX_BUF_SZ - rx->write_ptr + rx->read_ptr - 1U);

        if (free == 0) {
            uart8_last_pos = cur_pos;
            return;
        }

        uint32_t to_copy = (delta > free) ? free : delta;
        uint32_t first_dma = UART_RX_BUF_SZ - uart8_last_pos;
        if (first_dma > to_copy) first_dma = to_copy;
        dcache_invalidate32_range(uart8_dma_rx_buf + uart8_last_pos, first_dma);
        uint32_t second_dma = to_copy - first_dma;
        if (second_dma) dcache_invalidate32_range(uart8_dma_rx_buf, second_dma);
        uint32_t wp = rx->write_ptr;
        uint32_t first_ring = UART_RX_BUF_SZ - wp;
        uint32_t first_copy = (first_ring > first_dma) ? first_dma : first_ring;
        memcpy(rx->buf + wp, uart8_dma_rx_buf + uart8_last_pos, first_copy);
        wp = (wp + first_copy) & (UART_RX_BUF_SZ - 1U);
        uint32_t remain_first = first_dma - first_copy;
        if (remain_first) {
            memcpy(rx->buf + wp, uart8_dma_rx_buf + uart8_last_pos + first_copy, remain_first);
            wp = (wp + remain_first) & (UART_RX_BUF_SZ - 1U);
        }
        if (second_dma) {
            uint32_t ring_left = UART_RX_BUF_SZ - wp;
            uint32_t second_copy1 = (ring_left > second_dma) ? second_dma : ring_left;
            memcpy(rx->buf + wp, uart8_dma_rx_buf, second_copy1);
            wp = (wp + second_copy1) & (UART_RX_BUF_SZ - 1U);

            uint32_t second_copy2 = second_dma - second_copy1;
            if (second_copy2) {
                memcpy(rx->buf + wp, uart8_dma_rx_buf + second_copy1, second_copy2);
                wp = (wp + second_copy2) & (UART_RX_BUF_SZ - 1U);
            }
        }
        rx->write_ptr  = wp;
        uart8_last_pos = cur_pos;
    }
}

void uart7_rx_dma_start(void){
    HAL_UART_Receive_DMA(&huart7, uart7_dma_rx_buf, UART_RX_BUF_SZ);
    __HAL_DMA_ENABLE_IT(huart7.hdmarx, DMA_IT_HT | DMA_IT_TC);
    ((DMA_Stream_TypeDef *)huart7.hdmarx->Instance)->CR |= DMA_SxCR_CIRC;
    uart7_last_pos = dma_get_pos_stable(huart7.hdmarx);
}

uint32_t uart7_rx_available(void){
    uart7_rx_sync_from_dma();
    iot_uart_rx_ring_t *rx = UART7_RX;
    uint32_t w = rx->write_ptr;
    uint32_t r = rx->read_ptr;
    return (w >= r) ? (w - r) : (UART_RX_BUF_SZ - r + w);
}

