marttrach/ThreadX_STM32H750XBHx/Src/i2c_hub_uart.c
uint32_t uart7_rx_read(uint8_t *dst, uint32_t len){
    iot_uart_rx_ring_t *rx = UART7_RX;
    uint32_t avail = uart7_rx_available();
    if (len > avail) len = avail;
    uint32_t r = rx->read_ptr;
    uint32_t first = UART_RX_BUF_SZ - r;
    if (first > len) first = len;
    memcpy(dst, rx->buf + r, first);
    if (len > first) {
        memcpy(dst + first, rx->buf, len - first);
    }
    rx->read_ptr = (r + len) & (UART_RX_BUF_SZ - 1U);
    return len;
}

void uart8_rx_dma_start(void){
    
    HAL_UART_Receive_DMA(&huart8, uart8_dma_rx_buf, UART_RX_BUF_SZ);
    __HAL_DMA_ENABLE_IT(huart8.hdmarx, DMA_IT_HT | DMA_IT_TC);
    ((DMA_Stream_TypeDef *)huart8.hdmarx->Instance)->CR |= DMA_SxCR_CIRC;
    uart8_last_pos = dma_get_pos_stable(huart8.hdmarx);
}

uint32_t uart8_rx_available(void){
    uart8_rx_sync_from_dma(); 
    iot_uart_rx_ring_t *rx = UART8_RX;
    uint32_t w = rx->write_ptr;
    uint32_t r = rx->read_ptr;
    return (w >= r) ? (w - r) : (UART_RX_BUF_SZ - r + w);
}

uint32_t uart8_rx_read(uint8_t *dst, uint32_t len){
    iot_uart_rx_ring_t *rx = UART8_RX;
    uint32_t avail = uart8_rx_available();
    if (len > avail) len = avail;
    uint32_t r = rx->read_ptr;
    uint32_t first = UART_RX_BUF_SZ - r;
    if (first > len) first = len;
    memcpy(dst, rx->buf + r, first);
    if (len > first) {
        memcpy(dst + first, rx->buf, len - first);
    }
    rx->read_ptr = (r + len) & (UART_RX_BUF_SZ - 1U);
    return len;
}

/* TX */
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
#if IOT_UART_TX_USE_BLOCKING
    uart_tx_sem_map_t m = uart_tx_map(huart);
    if (m.done) {
        tx_semaphore_put(m.done);
    }
#else
    if(huart == &huart7){
        _uart7_tx_dma_done();
        _uart7_tx_dma_touch();
    }else if(huart == &huart8){
        _uart8_tx_dma_done();
        _uart8_tx_dma_touch();
    }
#endif
}

static inline void _uart_tx_dma_blocking(UART_HandleTypeDef *huart, const uint8_t *src, uint32_t len)
{
    if (src == NULL || len == 0U) return;
    uart_tx_sem_init_once();
    uart_tx_sem_map_t m = uart_tx_map(huart);
    if (m.huart == NULL || m.gate == NULL || m.done == NULL) {
        return;
    }

    if (tx_semaphore_get(m.gate, TX_WAIT_FOREVER) != TX_SUCCESS) {
        return;
    }
    dcache_clean32_range(src, len);
    HAL_StatusTypeDef st = HAL_UART_Transmit_DMA(huart, (uint8_t *)src, (uint16_t)len);
    if (st != HAL_OK) {
        tx_semaphore_put(m.gate);
        return;
    }
    if (tx_semaphore_get(m.done, TX_WAIT_FOREVER) != TX_SUCCESS) {
        (void)HAL_UART_AbortTransmit(huart);
        tx_semaphore_put(m.gate);
        return;
    }
    tx_semaphore_put(m.gate);
}

void _uart7_tx_dma_done(void){
    UART7_TX->busy = 0;
}

void _uart7_tx_dma_touch(void)
{
    static uint32_t s_guard_ts = 0;
    const  uint32_t GUARD_MS   = 5; 

    iot_uart_tx_ring_t *tx = UART7_TX;
    uint32_t w = tx->write_ptr, r = tx->read_ptr;

    if (tx->busy && huart7.hdmatx &&
        HAL_DMA_GetState(huart7.hdmatx) == HAL_DMA_STATE_READY) {
        tx->busy   = 0;
        s_guard_ts = 0;
    }

    if (tx->busy && huart7.hdmatx) {
        if (__HAL_DMA_GET_FLAG(huart7.hdmatx, TX_DMA_TC_FLAG)) {
            HAL_DMA_IRQHandler(huart7.hdmatx);
            s_guard_ts = 0;
            return;
        }
        if (__HAL_DMA_GET_FLAG(huart7.hdmatx, TX_DMA_ERR_FLAGS)) {
            __HAL_DMA_CLEAR_FLAG(huart7.hdmatx, TX_DMA_ERR_FLAGS);
            HAL_UART_IRQHandler(&huart7);
            s_guard_ts = 0;
            return;
        }
        if (HAL_DMA_GetState(huart7.hdmatx) == HAL_DMA_STATE_BUSY) {
            uint32_t now = HAL_GetTick();
            if (s_guard_ts == 0) s_guard_ts = now;
            else if ((now - s_guard_ts) > GUARD_MS) {
                (void)HAL_UART_AbortTransmit(&huart7);
                tx->busy   = 0;
                s_guard_ts = 0;
            }
            return;
        }
    }

    if (tx->busy) return;
    if (w == r)   { s_guard_ts = 0; return; }

    uint32_t data_len;
    uint8_t *src;
    if (w > r) { data_len = w - r;          src = tx->buf + r; }
    else       { data_len = UART_TX_BUF_SZ - r; src = tx->buf + r; }

    dcache_clean32_range(src, data_len);
    __DMB();

    if (huart7.hdmatx && HAL_DMA_GetState(huart7.hdmatx) != HAL_DMA_STATE_READY) return;

    HAL_StatusTypeDef st = HAL_UART_Transmit_DMA(&huart7, src, data_len);
    if (st == HAL_OK) {
        tx->busy     = 1;
        tx->read_ptr = (w > r) ? w : 0;
        s_guard_ts   = HAL_GetTick();
        return;
    }
    if (st == HAL_BUSY) {
        return;
    }

    if ((SCB->ICSR & SCB_ICSR_VECTACTIVE_Msk) == 0u) {
        uint32_t n = (data_len > 64U) ? 64U : data_len;
        if (HAL_UART_Transmit(&huart7, src, n, 100) == HAL_OK) {
            tx->read_ptr = (r + n) & (UART_TX_BUF_SZ - 1U);
        }
    }
}

void iot_uart7_tx_write(uint8_t *src, uint32_t len)
{
#if IOT_UART_TX_USE_BLOCKING
    _uart_tx_dma_blocking(&huart7, src, len);
#else
    iot_uart_tx_ring_t *tx = UART7_TX;

    __disable_irq();
    uint32_t r = tx->read_ptr;
    uint32_t w = tx->write_ptr;
    __enable_irq();

    uint32_t free = (r > w) ? (r - w - 1U) : (UART_TX_BUF_SZ - w + r - 1U);
    if (len > free) len = free;
    if (len == 0U) { _uart7_tx_dma_touch(); return; }

    uint32_t first = UART_TX_BUF_SZ - w;
    if (first > len) first = len;
    memcpy(tx->buf + w, src, first);
    if (len > first) {
        memcpy(tx->buf, src + first, len - first);
    }
    __DMB();

    __disable_irq();
    tx->write_ptr = (w + len) & (UART_TX_BUF_SZ - 1U);
    __enable_irq();

    _uart7_tx_dma_touch();
#endif
}

void _uart8_tx_dma_done(void){
    UART8_TX->busy = 0;
}

void _uart8_tx_dma_touch(void)
{
    static uint32_t s_guard_ts = 0;
    const  uint32_t GUARD_MS   = 5; 

    iot_uart_tx_ring_t *tx = UART8_TX;
    uint32_t w = tx->write_ptr, r = tx->read_ptr;

    if (tx->busy && huart8.hdmatx &&
        HAL_DMA_GetState(huart8.hdmatx) == HAL_DMA_STATE_READY) {
        tx->busy   = 0;
        s_guard_ts = 0;
    }

    if (tx->busy && huart8.hdmatx) {
        if (__HAL_DMA_GET_FLAG(huart8.hdmatx, TX_DMA_TC_FLAG)) {
            HAL_DMA_IRQHandler(huart8.hdmatx);
            s_guard_ts = 0;
            return;
        }
        if (__HAL_DMA_GET_FLAG(huart8.hdmatx, TX_DMA_ERR_FLAGS)) {
            __HAL_DMA_CLEAR_FLAG(huart8.hdmatx, TX_DMA_ERR_FLAGS);
            HAL_UART_IRQHandler(&huart8);
            s_guard_ts = 0;
            return;
        }
        if (HAL_DMA_GetState(huart8.hdmatx) == HAL_DMA_STATE_BUSY) {
            uint32_t now = HAL_GetTick();
            if (s_guard_ts == 0) s_guard_ts = now;
            else if ((now - s_guard_ts) > GUARD_MS) {
                (void)HAL_UART_AbortTransmit(&huart8);
                tx->busy   = 0;
                s_guard_ts = 0;
            }
            return;
        }
    }

