marttrach/ThreadX_STM32H750XBHx/Src/i2c_hub_uart.c
    if (tx->busy) return;
    if (w == r)   { s_guard_ts = 0; return; }

    uint32_t data_len;
    uint8_t *src;
    if (w > r) { data_len = w - r;          src = tx->buf + r; }
    else       { data_len = UART_TX_BUF_SZ - r; src = tx->buf + r; }

    dcache_clean32_range(src, data_len);
    __DMB();

    if (huart8.hdmatx && HAL_DMA_GetState(huart8.hdmatx) != HAL_DMA_STATE_READY) return;

    HAL_StatusTypeDef st = HAL_UART_Transmit_DMA(&huart8, src, data_len);
    if (st == HAL_OK) {
        tx->busy     = 1;
        tx->read_ptr = (w > r) ? w : 0;
        s_guard_ts   = HAL_GetTick();
        return;
    }
    if (st == HAL_BUSY) {
        return;
    }

    if ((SCB->ICSR & SCB_ICSR_VECTACTIVE_Msk) == 0u) {
        uint32_t n = (data_len > 64U) ? 64U : data_len;
        if (HAL_UART_Transmit(&huart8, src, n, 100) == HAL_OK) {
            tx->read_ptr = (r + n) & (UART_TX_BUF_SZ - 1U);
        }
    }
}

void iot_uart8_tx_write(uint8_t *src, uint32_t len)
{
#if IOT_UART_TX_USE_BLOCKING
    _uart_tx_dma_blocking(&huart8, src, len);
#else
    iot_uart_tx_ring_t *tx = UART8_TX;

    __disable_irq();
    uint32_t r = tx->read_ptr;
    uint32_t w = tx->write_ptr;
    __enable_irq();

    uint32_t free = (r > w) ? (r - w - 1U) : (UART_TX_BUF_SZ - w + r - 1U);
    if (len > free) len = free;
    if (len == 0U) { _uart8_tx_dma_touch(); return; }

    uint32_t first = UART_TX_BUF_SZ - w;
    if (first > len) first = len;
    memcpy(tx->buf + w, src, first);
    if (len > first) {
        memcpy(tx->buf, src + first, len - first);
    }
    __DMB();

    __disable_irq();
    tx->write_ptr = (w + len) & (UART_TX_BUF_SZ - 1U);
    __enable_irq();

    _uart8_tx_dma_touch();
#endif
}

/* Error Saver */
static inline void _uart_clear_all_errors_and_flush(UART_HandleTypeDef *huart)
{
    CLEAR_BIT(huart->Instance->CR3, USART_CR3_EIE);
    __HAL_UART_CLEAR_PEFLAG(huart);
    __HAL_UART_CLEAR_FEFLAG(huart);
    __HAL_UART_CLEAR_NEFLAG(huart);
    __HAL_UART_CLEAR_OREFLAG(huart);
    __HAL_UART_CLEAR_IDLEFLAG(huart);

    __HAL_UART_SEND_REQ(huart, UART_RXDATA_FLUSH_REQUEST);

    if (__HAL_UART_GET_FLAG(huart, UART_FLAG_RXNE) != RESET) {
        (void)huart->Instance->RDR;
    }
    SET_BIT(huart->Instance->CR3, USART_CR3_EIE);
}

static int _uart_restart_dma(UART_HandleTypeDef *huart, uint8_t *rx_dma_buf, volatile uint16_t *plast_pos)
{
    CLEAR_BIT(huart->Instance->CR3, USART_CR3_DMAR | USART_CR3_DMAT);

    if (huart->hdmarx) {
        if (HAL_DMA_GetState(huart->hdmarx) != HAL_DMA_STATE_READY) {
            (void)HAL_DMA_Abort(huart->hdmarx);
        }
        __HAL_DMA_DISABLE(huart->hdmarx);
        __HAL_DMA_CLEAR_FLAG(huart->hdmarx,
            DMA_FLAG_TEIF0_4 | DMA_FLAG_DMEIF0_4 | DMA_FLAG_FEIF0_4 |
            DMA_FLAG_HTIF0_4 | DMA_FLAG_TCIF0_4);
    }
    if (huart->hdmatx) {
        if (HAL_DMA_GetState(huart->hdmatx) != HAL_DMA_STATE_READY) {
            (void)HAL_DMA_Abort(huart->hdmatx);
        }
        __HAL_DMA_DISABLE(huart->hdmatx);
        __HAL_DMA_CLEAR_FLAG(huart->hdmatx,
            DMA_FLAG_TEIF0_4 | DMA_FLAG_DMEIF0_4 | DMA_FLAG_FEIF0_4 |
            DMA_FLAG_HTIF0_4 | DMA_FLAG_TCIF0_4);
    }

    DEBUG_DUMP(IOT_LOG_DEBUG, "UART recover: clear flags + flush (inst=%p)\r\n", huart->Instance);
    CLEAR_BIT(huart->Instance->CR3, USART_CR3_EIE);
    __HAL_UART_CLEAR_PEFLAG(huart);
    __HAL_UART_CLEAR_FEFLAG(huart);
    __HAL_UART_CLEAR_NEFLAG(huart);
    __HAL_UART_CLEAR_OREFLAG(huart);
    __HAL_UART_CLEAR_IDLEFLAG(huart);
    __HAL_UART_SEND_REQ(huart, UART_RXDATA_FLUSH_REQUEST);
    if (__HAL_UART_GET_FLAG(huart, UART_FLAG_RXNE) != RESET) {
        (void)huart->Instance->RDR;
    }
    SET_BIT(huart->Instance->CR3, USART_CR3_EIE);

    huart->ErrorCode = HAL_UART_ERROR_NONE;
    huart->gState    = HAL_UART_STATE_READY;
    huart->RxState   = HAL_UART_STATE_READY;

    dcache_invalidate32_range(rx_dma_buf, UART_RX_BUF_SZ);
    if (HAL_UART_Receive_DMA(huart, rx_dma_buf, UART_RX_BUF_SZ) != HAL_OK) {
        DEBUG_DUMP(IOT_LOG_DEBUG, "UART recover: HAL_UART_Receive_DMA failed (inst=%p)\r\n", huart->Instance);
        return 0;
    }
    if (huart->hdmarx) {
        __HAL_DMA_ENABLE_IT(huart->hdmarx, DMA_IT_HT | DMA_IT_TC);
        ((DMA_Stream_TypeDef *)huart->hdmarx->Instance)->CR |= DMA_SxCR_CIRC;
    }
    *plast_pos = dma_get_pos_stable(huart->hdmarx);

    SET_BIT(huart->Instance->CR3, USART_CR3_DMAR);

    DEBUG_DUMP(IOT_LOG_DEBUG, "UART recover: RX/TX DMA sanitized + RX restarted (inst=%p)\r\n", huart->Instance);
    return 1;
}

static void _uart_recover_tx_if_busy(UART_HandleTypeDef *huart, iot_uart_tx_ring_t *tx, uint32_t err)
{
    if (!tx || !tx->busy) return;
    DEBUG_DUMP(IOT_LOG_DEBUG, "UART recover: TX busy → abort TX DMA (inst=%p, err=0x%08lX)\r\n",
               huart->Instance, (unsigned long)err);
    (void)HAL_UART_AbortTransmit(huart);
    tx->busy = 0;
}

static void uart_port_recover(UART_HandleTypeDef *huart, const char *why)
{
    uint32_t err = HAL_UART_GetError(huart);
    uint8_t *rx_dma_buf = NULL;
    volatile uint16_t *plast_pos = NULL;
    iot_uart_tx_ring_t *tx = NULL;

    DEBUG_DUMP(IOT_LOG_DEBUG, "UART recover called (inst=%p err=0x%08lX)\r\n",
               huart->Instance, (unsigned long)err);

    _uart_port_map(huart, &rx_dma_buf, &plast_pos, &tx);
    DEBUG_DUMP(IOT_LOG_DEBUG, "UART recover: mapped (rx_dma_buf=%p plast_pos=%p tx=%p)\r\n",
               rx_dma_buf, plast_pos, tx);

    (void)_uart_restart_dma(huart, rx_dma_buf, plast_pos);

    uint32_t now = HAL_GetTick();
    volatile uint32_t *ptick = (huart == &huart7) ? &s_u7_err_tick : &s_u8_err_tick;
    volatile uint8_t  *pcnt  = (huart == &huart7) ? &s_u7_err_cnt  : &s_u8_err_cnt;

    if ((now - *ptick) <= UART_RECOVER_ESCALATION_MS) {
        if (*pcnt < 0xFF) (*pcnt)++;
    } else {
        *pcnt = 1;
    }
    *ptick = now;

    DEBUG_DUMP(IOT_LOG_DEBUG, "UART recover(%s): inst=%p err=0x%08lX cnt=%u\r\n",
               why, huart->Instance, (unsigned long)err, *pcnt);

    _uart_recover_tx_if_busy(huart, tx, err);

    if (*pcnt >= UART_RECOVER_THRESHOLD) {
        DEBUG_DUMP(IOT_LOG_DEBUG, "UART recover: escalation (deinit/init)\r\n");
        (void)HAL_UART_DeInit(huart);
        (void)HAL_UART_Init(huart);
        (void)_uart_restart_dma(huart, rx_dma_buf, plast_pos);
        *pcnt = 0;
    }
    if (tx) { tx->busy = 0; }
    if (huart == &huart7) _uart7_tx_dma_touch();
    else if (huart == &huart8) _uart8_tx_dma_touch();

