marttrach/ThreadX_STM32H750XBHx/Src/i2c_hub_uart.c
    DEBUG_DUMP(IOT_LOG_DEBUG, "UART recover: done (inst=%p)\r\n", huart->Instance);
}


void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
    if (huart->hdmarx) {
        uint32_t rxerr = huart->hdmarx->ErrorCode;
        if (rxerr) DEBUG_DUMP(IOT_LOG_ERR, "UART DMA RX err=0x%08lX\r\n", (unsigned long)rxerr);
    }
    if (huart->hdmatx) {
        uint32_t txerr = huart->hdmatx->ErrorCode;
        if (txerr) DEBUG_DUMP(IOT_LOG_ERR, "UART DMA TX err=0x%08lX\r\n", (unsigned long)txerr);
    }
    uart_port_recover(huart, "HAL_UART_ErrorCallback");
    uart_tx_sem_map_t m = uart_tx_map(huart);
    if (m.done) {
        tx_semaphore_put(m.done);
    }
}

void HAL_UART_AbortCpltCallback(UART_HandleTypeDef *huart)
{
    uart_tx_sem_map_t m = uart_tx_map(huart);
    if (m.done) {
        tx_semaphore_put(m.done);
    }
}

/* Thread */
void uart7_thread_start(void)
{
    if (s_uart7_started) return;
    if (!uart_resp_ctx_init(&s_u7_ctx)) return; /* OOM 保護 */
    tx_queue_create(&s_uart7_q, "uart7_q", TX_1_ULONG, s_uart7_q_buf, sizeof(s_uart7_q_buf));
    tx_thread_create(&s_uart7_thread, "uart7_thread", uart7_thread_entry, 0,
                     s_uart7_stack, sizeof(s_uart7_stack),
                     12, 12, TX_NO_TIME_SLICE, TX_AUTO_START);
    s_uart7_started = 1;
}

void uart8_thread_start(void)
{
    if (s_uart8_started) return;
    if (!uart_resp_ctx_init(&s_u8_ctx)) return;
    tx_queue_create(&s_uart8_q, "uart8_q", TX_1_ULONG, s_uart8_q_buf, sizeof(s_uart8_q_buf));
    tx_thread_create(&s_uart8_thread, "uart8_thread", uart8_thread_entry, 0,
                     s_uart8_stack, sizeof(s_uart8_stack),
                     12, 12, TX_NO_TIME_SLICE, TX_AUTO_START);
    s_uart8_started = 1;
}

int uart7_post_read(uint16_t len, uint32_t data_addr)
{
    if (!s_uart7_started) return 0;
    uart_cmd_msg_t msg = { .type = UART_CMD_READ, .len = len, .data_addr = data_addr };
    return (tx_queue_send(&s_uart7_q, &msg, TX_NO_WAIT) == TX_SUCCESS);
}

int uart8_post_read(uint16_t len, uint32_t data_addr)
{
    if (!s_uart8_started) return 0;
    uart_cmd_msg_t msg = { .type = UART_CMD_READ, .len = len, .data_addr = data_addr };
    return (tx_queue_send(&s_uart8_q, &msg, TX_NO_WAIT) == TX_SUCCESS);
}

static VOID uart7_thread_entry(ULONG arg)
{
    (void)arg;
    for (;;) {
        uart_cmd_msg_t msg;
        if (tx_queue_receive(&s_uart7_q, &msg, TX_WAIT_FOREVER) != TX_SUCCESS) continue;

        if (msg.type == UART_CMD_READ) {
            uart_resp_slot_t *slot = uart_resp_take_free(&s_u7_ctx);
            if (!slot) {
                continue;
            }

            uint8_t *dst = slot->frame;
            hub_rsp_t *rsp = (hub_rsp_t*)dst;

            uint16_t req   = msg.len;                 /* 0 => PEEK */
            uart7_rx_sync_from_dma();
            uint16_t avail = (uint16_t)uart7_rx_available();
            uint16_t need  = (req == 0U) ? 0U : ( (req < avail) ? req : avail );
            uint32_t frame_len = (req == 0U) ? (RSP_HDR_SZ + 4U) : (RSP_HDR_SZ + (uint32_t)req + 4U);

            rsp->status    = HUB_RSP_OK;
            rsp->reserved  = 0;
            rsp->len       = (req == 0U) ? avail : req; 
            rsp->data_addr = msg.data_addr;

            if (req > 0U) {
                uint8_t *payload = dst + RSP_HDR_SZ;
                uint32_t got = 0;
                while (got < need) {
                    uint32_t g = uart7_rx_read(payload + got, (uint32_t)(need - got));
                    got += g;
                    if (g == 0U) break;
                }
                if (need < req) {
                    memset(payload + need, HUB_ERR_FILL_BYTE, (size_t)(req - need));
                }
            }
            uint32_t crc = iot_hub_crc32_hard(dst, frame_len - 4U);
            memcpy(dst + frame_len - 4U, &crc, 4U);

            slot->task.total = frame_len;
            (void)hub_send_tx_task(&slot->task);
        }
    }
}

static VOID uart8_thread_entry(ULONG arg)
{
    (void)arg;
    for (;;) {
        uart_cmd_msg_t msg;
        if (tx_queue_receive(&s_uart8_q, &msg, TX_WAIT_FOREVER) != TX_SUCCESS) continue;

        if (msg.type == UART_CMD_READ) {
            uart_resp_slot_t *slot = uart_resp_take_free(&s_u8_ctx);
            if (!slot) { continue; }

            uint8_t *dst = slot->frame;
            hub_rsp_t *rsp = (hub_rsp_t*)dst;

            uint16_t req   = msg.len;                 /* 0 => PEEK */
            uart8_rx_sync_from_dma(); 
            uint16_t avail = (uint16_t)uart8_rx_available();
            uint16_t need  = (req == 0U) ? 0U : ( (req < avail) ? req : avail );
            uint32_t frame_len = (req == 0U) ? (RSP_HDR_SZ + 4U) : (RSP_HDR_SZ + (uint32_t)req + 4U);

            rsp->status    = HUB_RSP_OK;
            rsp->reserved  = 0;
            rsp->len       = (req == 0U) ? avail : req;
            rsp->data_addr = msg.data_addr;

            if (req > 0U) {
                uint8_t *payload = dst + RSP_HDR_SZ;
                uint32_t got = 0;
                while (got < need) {
                    uint32_t g = uart8_rx_read(payload + got, (uint32_t)(need - got));
                    got += g;
                    if (g == 0U) break;
                }
                if (need < req) {
                    memset(payload + need, HUB_ERR_FILL_BYTE, (size_t)(req - need));
                }
            }

            uint32_t crc = iot_hub_crc32_hard(dst, frame_len - 4U);
            memcpy(dst + frame_len - 4U, &crc, 4U);

            slot->task.total = frame_len;
            (void)hub_send_tx_task(&slot->task);
        }
    }
}